; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared1 - mode
	image2 - mode
	image3 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 130)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 132)
	(supports instrument3 image2)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 image3)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 171)
	(= (data Star3 infrared1) 265)
	(= (data Phenomenon4 infrared1) 271)
	(= (data Phenomenon5 infrared1) 252)
	(= (data Planet6 infrared1) 142)
	(= (data Planet7 infrared1) 192)
	(= (data Star8 infrared1) 267)
	(= (data Star3 image2) 110)
	(= (data Phenomenon4 image2) 254)
	(= (data Phenomenon5 image2) 89)
	(= (data Planet6 image2) 165)
	(= (data Planet7 image2) 16)
	(= (data Star8 image2) 286)
	(= (data Star3 image3) 105)
	(= (data Phenomenon4 image3) 154)
	(= (data Phenomenon5 image3) 238)
	(= (data Planet6 image3) 159)
	(= (data Planet7 image3) 120)
	(= (data Star8 image3) 133)
	(= (data Star3 thermograph0) 168)
	(= (data Phenomenon4 thermograph0) 105)
	(= (data Phenomenon5 thermograph0) 229)
	(= (data Planet6 thermograph0) 265)
	(= (data Planet7 thermograph0) 148)
	(= (data Star8 thermograph0) 162)
	(= (slew_time GroundStation1 Star0) 14.46)
	(= (slew_time Star0 GroundStation1) 14.46)
	(= (slew_time GroundStation2 Star0) 25.81)
	(= (slew_time Star0 GroundStation2) 25.81)
	(= (slew_time GroundStation2 GroundStation1) 54)
	(= (slew_time GroundStation1 GroundStation2) 54)
	(= (slew_time Star3 Star0) 43.16)
	(= (slew_time Star0 Star3) 43.16)
	(= (slew_time Star3 GroundStation1) 26.72)
	(= (slew_time GroundStation1 Star3) 26.72)
	(= (slew_time Star3 GroundStation2) 15.26)
	(= (slew_time GroundStation2 Star3) 15.26)
	(= (slew_time Phenomenon4 Star0) 68.49)
	(= (slew_time Star0 Phenomenon4) 68.49)
	(= (slew_time Phenomenon4 GroundStation1) 85.68)
	(= (slew_time GroundStation1 Phenomenon4) 85.68)
	(= (slew_time Phenomenon4 GroundStation2) 16.02)
	(= (slew_time GroundStation2 Phenomenon4) 16.02)
	(= (slew_time Phenomenon4 Star3) 15.18)
	(= (slew_time Star3 Phenomenon4) 15.18)
	(= (slew_time Phenomenon5 Star0) 64.98)
	(= (slew_time Star0 Phenomenon5) 64.98)
	(= (slew_time Phenomenon5 GroundStation1) 5.372)
	(= (slew_time GroundStation1 Phenomenon5) 5.372)
	(= (slew_time Phenomenon5 GroundStation2) 25.59)
	(= (slew_time GroundStation2 Phenomenon5) 25.59)
	(= (slew_time Phenomenon5 Star3) 29.65)
	(= (slew_time Star3 Phenomenon5) 29.65)
	(= (slew_time Phenomenon5 Phenomenon4) 12.78)
	(= (slew_time Phenomenon4 Phenomenon5) 12.78)
	(= (slew_time Planet6 Star0) 34.75)
	(= (slew_time Star0 Planet6) 34.75)
	(= (slew_time Planet6 GroundStation1) 91.95)
	(= (slew_time GroundStation1 Planet6) 91.95)
	(= (slew_time Planet6 GroundStation2) 22.08)
	(= (slew_time GroundStation2 Planet6) 22.08)
	(= (slew_time Planet6 Star3) 89.94)
	(= (slew_time Star3 Planet6) 89.94)
	(= (slew_time Planet6 Phenomenon4) 43.33)
	(= (slew_time Phenomenon4 Planet6) 43.33)
	(= (slew_time Planet6 Phenomenon5) 37.84)
	(= (slew_time Phenomenon5 Planet6) 37.84)
	(= (slew_time Planet7 Star0) 0.9901)
	(= (slew_time Star0 Planet7) 0.9901)
	(= (slew_time Planet7 GroundStation1) 46.06)
	(= (slew_time GroundStation1 Planet7) 46.06)
	(= (slew_time Planet7 GroundStation2) 44.47)
	(= (slew_time GroundStation2 Planet7) 44.47)
	(= (slew_time Planet7 Star3) 52.7)
	(= (slew_time Star3 Planet7) 52.7)
	(= (slew_time Planet7 Phenomenon4) 13.27)
	(= (slew_time Phenomenon4 Planet7) 13.27)
	(= (slew_time Planet7 Phenomenon5) 56.92)
	(= (slew_time Phenomenon5 Planet7) 56.92)
	(= (slew_time Planet7 Planet6) 31.4)
	(= (slew_time Planet6 Planet7) 31.4)
	(= (slew_time Star8 Star0) 64.89)
	(= (slew_time Star0 Star8) 64.89)
	(= (slew_time Star8 GroundStation1) 73.84)
	(= (slew_time GroundStation1 Star8) 73.84)
	(= (slew_time Star8 GroundStation2) 15.87)
	(= (slew_time GroundStation2 Star8) 15.87)
	(= (slew_time Star8 Star3) 6.343)
	(= (slew_time Star3 Star8) 6.343)
	(= (slew_time Star8 Phenomenon4) 21.35)
	(= (slew_time Phenomenon4 Star8) 21.35)
	(= (slew_time Star8 Phenomenon5) 75.62)
	(= (slew_time Phenomenon5 Star8) 75.62)
	(= (slew_time Star8 Planet6) 17.84)
	(= (slew_time Planet6 Star8) 17.84)
	(= (slew_time Star8 Planet7) 43.14)
	(= (slew_time Planet7 Star8) 43.14)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Planet7)
	(have_image Star3 image2)
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 image3)
	(have_image Planet7 image3)
	(have_image Star8 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 phenomenon4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 171 to 102.51, (fuel-used) from 0 to 68.49
   goals met: 0 of 6
2. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 132 to 126.628, (fuel-used) from 68.49 to 73.862
   goals met: 0 of 6
3. (turn_to satellite0 star3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 130 to 123.657, (fuel-used) from 73.862 to 80.205
   goals met: 0 of 6
4. (turn_to satellite2 planet7 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 102.51 to 89.24, (fuel-used) from 80.205 to 93.475
   goals met: 1 of 6
5. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 126.628 to 121.256, (fuel-used) from 93.475 to 98.847
   goals met: 1 of 6
6. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
7. (turn_to satellite1 star0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 121.256 to 106.796, (fuel-used) from 98.847 to 113.307
   goals met: 1 of 6
8. (turn_to satellite1 planet7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 106.796 to 105.806, (fuel-used) from 113.307 to 114.297
   goals met: 1 of 6
9. (turn_to satellite1 star0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 105.806 to 104.816, (fuel-used) from 114.297 to 115.287
   goals met: 1 of 6
10. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 104.816 to 90.3558, (fuel-used) from 115.287 to 129.747
   goals met: 1 of 6
11. (turn_to satellite1 star0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 90.3558 to 75.8958, (fuel-used) from 129.747 to 144.207
   goals met: 1 of 6
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
13. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 75.8958 to 61.4358, (fuel-used) from 144.207 to 158.667
   goals met: 1 of 6
14. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 6
15. (turn_to satellite1 star0 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 61.4358 to 46.9758, (fuel-used) from 158.667 to 173.127
   goals met: 1 of 6
16. (turn_to satellite1 planet7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 46.9758 to 45.9857, (fuel-used) from 173.127 to 174.117
   goals met: 1 of 6
17. (turn_to satellite0 groundstation1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 123.657 to 96.937, (fuel-used) from 174.117 to 200.837
   goals met: 1 of 6
18. (turn_to satellite1 planet6 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 45.9857 to 14.5857, (fuel-used) from 200.837 to 232.237
   goals met: 1 of 6
19. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 6
20. (turn_to satellite0 star3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 96.937 to 70.217, (fuel-used) from 232.237 to 258.957
   goals met: 1 of 6
21. (turn_to satellite2 star0 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 89.24 to 88.2499, (fuel-used) from 258.957 to 259.947
   goals met: 0 of 6
22. (take_image satellite0 star3 instrument0 image2)
   added: (have_image star3 image2)
   changed: (data_capacity satellite0) from 1000 to 890, (data-stored) from 0 to 110
   goals met: 1 of 6
23. (turn_to satellite0 phenomenon4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 70.217 to 55.037, (fuel-used) from 259.947 to 275.127
   goals met: 1 of 6
24. (turn_to satellite2 planet7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 88.2499 to 87.2598, (fuel-used) from 275.127 to 276.118
   goals met: 2 of 6
25. (turn_to satellite0 phenomenon5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 55.037 to 42.257, (fuel-used) from 276.118 to 288.897
   goals met: 2 of 6
26. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   changed: (data_capacity satellite0) from 890 to 638, (data-stored) from 110 to 362
   goals met: 3 of 6
27. (turn_to satellite0 phenomenon4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 42.257 to 29.477, (fuel-used) from 288.897 to 301.677
   goals met: 3 of 6
28. (turn_to satellite0 star8 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 29.477 to 8.127, (fuel-used) from 301.677 to 323.027
   goals met: 3 of 6
29. (turn_to satellite2 star0 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 87.2598 to 86.2697, (fuel-used) from 323.027 to 324.018
   goals met: 2 of 6
30. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 6
31. (turn_to satellite2 groundstation2 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 86.2697 to 60.4597, (fuel-used) from 324.018 to 349.828
   goals met: 2 of 6
32. (calibrate satellite2 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 6
33. (turn_to satellite2 planet7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 60.4597 to 15.9897, (fuel-used) from 349.828 to 394.298
   goals met: 3 of 6
34. (take_image satellite1 planet6 instrument2 image3)
   added: (have_image planet6 image3)
   changed: (data_capacity satellite1) from 1000 to 841, (data-stored) from 362 to 521
   goals met: 4 of 6
35. (take_image satellite2 planet7 instrument3 image3)
   added: (have_image planet7 image3)
   changed: (data_capacity satellite2) from 1000 to 880, (data-stored) from 521 to 641
   goals met: 5 of 6
36. (take_image satellite0 star8 instrument0 infrared1)
   added: (have_image star8 infrared1)
   changed: (data_capacity satellite0) from 638 to 371, (data-stored) from 641 to 908
   goals met: 6 of 6
